{
  "products": [
    {
      "title": "CyberPunk 2077",
      "publisher": "CD Project",
      "developer": "CD Project RED",
      "year": "2021",
      "genre": "Action",
      "description": "Cyberpunk 2077 is an action role-playing video game developed and published by CD Projekt. The story takes place in Night City, an open world set in the Cyberpunk universe. Players assume the first-person perspective of a customisable mercenary known as V, who can acquire skills in hacking and machinery with options for melee and ranged combat.  The game was developed using the REDengine 4 by a team of around 500 people, exceeding the number that worked on the studio's previous game The Witcher 3: Wild Hunt (2015). CD Projekt launched a new division in Wrocław, Poland, and partnered with Digital Scapes, Nvidia, QLOC, and Jali Research to aid the production. Cyberpunk creator Mike Pondsmith was a consultant, and actor Keanu Reeves has a starring role. The original score was led by Marcin Przybyłowicz, featuring the contributions of several licensed artists.  After years of anticipation, CD Projekt released Cyberpunk 2077 for PlayStation 4, Stadia, Windows, and Xbox One on 10 December 2020, with PlayStation 5 and Xbox Series X/S versions planned to follow in 2021. It received praise for its narrative, setting, and graphics, although some of its gameplay elements received mixed responses, while its themes and representation of transgender characters received scrutiny. It was also widely criticized for bugs, particularly in the console versions, which suffered from performance problems; Sony removed it from the PlayStation Store from December 2020 to June 2021 while CD Projekt rectified some of the problems. CD Projekt became subject to investigations and class-action lawsuits for their perceived attempts in downplaying the severity of the technical problems before release.",
      "price": "30",
      "poster": "https://upload.wikimedia.org/wikipedia/en/9/9f/Cyberpunk_2077_box_art.jpg",
      "id": 1
    },
    {
      "title": "Grand Theft Auto 5",
      "publisher": "Rockstar Games",
      "developer": "Rockstar Games",
      "year": "2013",
      "genre": "Action",
      "description": "Grand Theft Auto V is a 2013 action-adventure game developed by Rockstar North and published by Rockstar Games. It is the seventh main entry in the Grand Theft Auto series, following 2008's Grand Theft Auto IV, and the fifteenth instalment overall. Set within the fictional state of San Andreas, based on Southern California, the single-player story follows three protagonists—retired bank robber Michael De Santa, street gangster Franklin Clinton, and drug dealer and gunrunner Trevor Philips—and their attempts to commit heists while under pressure from a corrupt government agency and powerful criminals. The open world design lets players freely roam San Andreas' open countryside and the fictional city of Los Santos, based on Los Angeles.  The game is played from either a third-person or first-person perspective, and its world is navigated on foot and by vehicle. Players control the three lead protagonists throughout single-player and switch among them, both during and outside missions. The story is centred on the heist sequences, and many missions involve shooting and driving gameplay. A \"wanted\" system governs the aggression of law enforcement response to players who commit crimes. Grand Theft Auto Online, the game's online multiplayer mode, lets up to 30 players engage in a variety of different cooperative and competitive game modes.  The game's development began soon after Grand Theft Auto IV's release and was shared between many of Rockstar's studios worldwide. The development team drew influence from many of their previous projects such as Red Dead Redemption and Max Payne 3 and designed the game around three lead protagonists to innovate on the core structure of its predecessors. Much of the development work constituted the open world's creation, and several team members conducted field research around California to capture footage for the design team. The game's soundtrack features an original score composed by a team of producers who collaborated over several years. It was released in September 2013 for the PlayStation 3 and Xbox 360, in November 2014 for the PlayStation 4 and Xbox One, and April 2015 for Microsoft Windows. PlayStation 5 and Xbox Series X/S versions are scheduled for release in March 2022.  Extensively marketed and widely anticipated, the game broke industry sales records and became the fastest-selling entertainment product in history, earning $800 million in its first day and $1 billion in its first three days. It received widespread critical acclaim, with praise directed at its multiple protagonist design, open world, presentation and gameplay. However, it caused controversies related to its depiction of violence and women. Considered one of seventh and eighth generation console gaming's most significant titles and among the best video games ever made, it won year-end accolades including Game of the Year awards from several gaming publications. It is the second best-selling video game of all time with over 150 million copies shipped, and as of April 2018, the most financially successful entertainment product of all time, with about $6 billion in worldwide revenue.",
      "price": "13",
      "poster": "https://cdn.cloudflare.steamstatic.com/steam/apps/271590/header.jpg?t=1618856444",
      "id": 2
    },
    {
      "title": "WarCraft 3",
      "publisher": "Blizzard Entertainment",
      "developer": "Blizzard Entertainment",
      "year": "2002",
      "genre": "Strategy",
      "description": "Warcraft III: Reign of Chaos is a high fantasy real-time strategy computer video game developed and published by Blizzard Entertainment released in July 2002. It is the second sequel to Warcraft: Orcs & Humans, after Warcraft II: Tides of Darkness, the third game set in the Warcraft fictional universe, and the first to be rendered in three dimensions. An expansion pack, The Frozen Throne, was released in July 2003. Warcraft III is set several years after the events of Warcraft II, and tells the story of the Burning Legion's attempt to conquer the fictional world of Azeroth with the help of an army of the Undead, led by fallen paladin Arthas Menethil. It chronicles the combined efforts of the Human Alliance, Orcish Horde, and Night Elves to stop them before they can corrupt the World Tree.  In the game, as in many real-time strategy (RTS) games, players collect resources, train individual units and heroes, and build bases in order to achieve various goals (in single-player mode), or to defeat the enemy player. Four playable factions can be chosen from: Humans, Orcs, (both of which appeared in the previous games) and two new factions: the Night Elves and the Undead. Warcraft III's single-player campaign is laid out similarly to that of StarCraft, and is told through the races in a progressive manner. Players can also play matches against the computer, or against others—using local area networking (LAN) or Blizzard's Battle.net gaming platform.  After Warcraft II: Beyond the Dark Portal, the last in the Warcraft II saga, was released in 1996, Blizzard began development of a point-and-click adventure game called Warcraft Adventures: Lord of the Clans, which was supposed to continue the story. Lord of the Clans was canceled in favor of Warcraft III in 1998, which was presented to the public at the European Computer Trade Show in September 1999. The game's design and gameplay was significantly altered during development, with the final game sharing little similarities with the originally presented version (see similarities to StarCraft).  The game received acclaim from critics, who praised the game's presentation and multiplayer features. It is considered an influential example of RTS video games. Warcraft III was a commercial success, shipping 4.4 million copies to retail stores,[1] selling over a million within a month. In 2020, Blizzard released a remastered version of both Warcraft III and its expansion, The Frozen Throne, called Warcraft III: Reforged.",
      "price": "30",
      "poster": "https://upload.wikimedia.org/wikipedia/en/6/66/WarcraftIII.jpg",
      "id": 3
    },
    {
      "title": "Dota 2",
      "publisher": "Valve",
      "developer": "Valve",
      "year": "2013",
      "genre": "MOBA",
      "description": "Dota 2 is a multiplayer online battle arena (MOBA) video game developed and published by Valve. The game is a sequel to Defense of the Ancients (DotA), which was a community-created mod for Blizzard Entertainment's Warcraft III: Reign of Chaos. Dota 2 is played in matches between two teams of five players, with each team occupying and defending their own separate base on the map. Each of the ten players independently controls a powerful character, known as a \"hero\", who all have unique abilities and differing styles of play. During a match players collect experience points and items for their heroes to successfully defeat the opposing team's heroes in player versus player combat. A team wins by being the first to destroy the other team's \"Ancient\", a large structure located within their base.  Development of Dota 2 began in 2009 when IceFrog, lead designer of Defense of the Ancients, was hired by Valve to create a modernized remake for them in the Source game engine. It was released for Microsoft Windows, OS X, and Linux via the digital distribution platform Steam in July 2013, following a Windows-only open beta phase that began two years prior. The game is fully free-to-play with no heroes or any other gameplay element needing to be bought or otherwise unlocked. To maintain it, Valve supports the game as a service, selling loot boxes and a battle pass subscription system called Dota Plus that offer non-gameplay altering virtual goods in return, such as hero cosmetics and audio replacement packs. The game has also been updated with various other features since release, such as a port to the Source 2 engine and support for virtual reality.  Dota 2 has a large esports scene, with teams from around the world playing in various professional leagues and tournaments. Valve manages an event format known as the Dota Pro Circuit, which are a series of tournaments that award qualification points for earning direct invitations to The International, the game's premier annual tournament. Internationals feature a crowdfunded prize money system that has seen amounts in upwards of US$30 million, making Dota 2 the most lucrative esports game. Media coverage of most tournaments is done by a selection of on-site staff who provide commentary and analysis for the ongoing matches, similar to traditional sporting events. In addition to playing live to audiences in arenas and stadiums, broadcasts of them are also streamed over the internet, and sometimes simulcast on television networks, with peak viewership numbers in the millions.  Despite some criticism going towards its steep learning curve and overall complexity, Dota 2 was praised for its rewarding gameplay, production quality, and faithfulness to its predecessor, with many considering it to be one of the greatest video games of all time. It has been one of the most played games on Steam since its release, with over a million concurrent players at its peak. The popularity of the game has led to official merchandise and media adaptations for it being produced, including comic books and an anime series, as well as promotional tie-ins to other games and media. The game also allows for the community to create their own gamemodes, maps, and cosmetics, which are uploaded to the Steam Workshop. Two spinoff games, Artifact and Dota Underlords, were also released by Valve. Dota 2 has also been used in machine learning experiments, with a team of bots known as the OpenAI Five showing the capability to defeat professional players.",
      "price": "0",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/0/0b/Dota_2_%28Steam_2019%29.jpg/440px-Dota_2_%28Steam_2019%29.jpg",
      "id": 4
    },
    {
      "title": "FIFA 2021",
      "publisher": "Electronic Arts",
      "developer": "Electronic Arts",
      "year": "2020",
      "genre": "Sport",
      "description": "Dota 2 is a multiplayer online battle arena (MOBA) video game developed and published by Valve. The game is a sequel to Defense of the Ancients (DotA), which was a community-created mod for Blizzard Entertainment's Warcraft III: Reign of Chaos. Dota 2 is played in matches between two teams of five players, with each team occupying and defending their own separate base on the map. Each of the ten players independently controls a powerful character, known as a \"hero\", who all have unique abilities and differing styles of play. During a match players collect experience points and items for their heroes to successfully defeat the opposing team's heroes in player versus player combat. A team wins by being the first to destroy the other team's \"Ancient\", a large structure located within their base.  Development of Dota 2 began in 2009 when IceFrog, lead designer of Defense of the Ancients, was hired by Valve to create a modernized remake for them in the Source game engine. It was released for Microsoft Windows, OS X, and Linux via the digital distribution platform Steam in July 2013, following a Windows-only open beta phase that began two years prior. The game is fully free-to-play with no heroes or any other gameplay element needing to be bought or otherwise unlocked. To maintain it, Valve supports the game as a service, selling loot boxes and a battle pass subscription system called Dota Plus that offer non-gameplay altering virtual goods in return, such as hero cosmetics and audio replacement packs. The game has also been updated with various other features since release, such as a port to the Source 2 engine and support for virtual reality.  Dota 2 has a large esports scene, with teams from around the world playing in various professional leagues and tournaments. Valve manages an event format known as the Dota Pro Circuit, which are a series of tournaments that award qualification points for earning direct invitations to The International, the game's premier annual tournament. Internationals feature a crowdfunded prize money system that has seen amounts in upwards of US$30 million, making Dota 2 the most lucrative esports game. Media coverage of most tournaments is done by a selection of on-site staff who provide commentary and analysis for the ongoing matches, similar to traditional sporting events. In addition to playing live to audiences in arenas and stadiums, broadcasts of them are also streamed over the internet, and sometimes simulcast on television networks, with peak viewership numbers in the millions.  Despite some criticism going towards its steep learning curve and overall complexity, Dota 2 was praised for its rewarding gameplay, production quality, and faithfulness to its predecessor, with many considering it to be one of the greatest video games of all time. It has been one of the most played games on Steam since its release, with over a million concurrent players at its peak. The popularity of the game has led to official merchandise and media adaptations for it being produced, including comic books and an anime series, as well as promotional tie-ins to other games and media. The game also allows for the community to create their own gamemodes, maps, and cosmetics, which are uploaded to the Steam Workshop. Two spinoff games, Artifact and Dota Underlords, were also released by Valve. Dota 2 has also been used in machine learning experiments, with a team of bots known as the OpenAI Five showing the capability to defeat professional players.",
      "price": "60",
      "poster": "https://upload.wikimedia.org/wikipedia/en/b/bb/FIFA_21_Standard_Edition_Cover.jpg",
      "id": 5
    },
    {
      "title": "Dead Space",
      "publisher": "Electronic Arts",
      "developer": "EA Redwood Shores",
      "year": "2008",
      "genre": "Horror",
      "description": "Dead Space is a 2008 survival horror video game developed by EA Redwood Shores and published by Electronic Arts for the PlayStation 3, Xbox 360 and Microsoft Windows. Released in October 2008, the title was the first in the Dead Space franchise and drew inspiration from other works of horror, notably Resident Evil 4 and the Silent Hill series.  Set on a mining spaceship overrun by monsters called Necromorphs, the player controls engineer Isaac Clarke from the third-person perspective as he navigates the spaceship, fights Necromorphs, and struggles with increasing psychosis. The player explores areas on the station through a chapter-based narrative, solving environmental puzzles while finding ammunition and equipment to survive. Isaac wields engineering equipment as weapons.  Dead Space was pitched in early 2006 and fit Electronic Arts' priority of creating new intellectual properties. A prototype of the game was developed for the original Xbox console and lasted 18 months. The team aimed for realism and innovation in their design. In the pursuit of these goals, the team removed set spawn points for enemies and omitted the heads-up display in favor of presenting information in the world. Immersive and frightening sound design was a large priority during production, and the score by Jason Graves was noted by critics to successfully evoke tension and unease.  Dead Space debuted weak in sales but eventually sold over a million copies worldwide. The game was met with critical acclaim: reviewers praised its atmosphere, gameplay and sound design. It won and was nominated for multiple industry awards and has been ranked by journalists as one of the greatest video games ever made. It spawned two numbered sequels (released in 2011 and 2013), several spin-off titles, and other related media, including a comic book prequel and an animated film. A remake of Dead Space is currently in development by EA's Motive Studios.",
      "price": "20",
      "poster": "https://upload.wikimedia.org/wikipedia/en/5/57/Dead_Space_Box_Art.jpg",
      "id": 6
    },
    {
      "title": "Super Mario Odyssey",
      "publisher": "Nintendo",
      "developer": "Nintendo EPD",
      "year": "2017",
      "genre": "Platformer",
      "description": "Super Mario Odyssey[b] is a 2017 platform game developed and published by Nintendo for the Nintendo Switch video game console. An entry in the Super Mario series, it follows Mario and his new ally Cappy—a sentient hat that allows Mario to control other characters and objects—as they journey across various kingdoms to save Princess Peach from his nemesis Bowser and his plans of forced marriage. In contrast to the linear gameplay of prior entries, the game returns to the primarily open-ended, 3D platform gameplay featured in Super Mario 64 and Super Mario Sunshine.[1]  In Odyssey, Mario explores various kingdoms and collects Power Moons hidden inside them, which is used as a source of fuel to power \"The Odyssey\", an airship, to travel to new locations. Cappy's main function is the \"capture\" ability, which allows Mario to assume possession of enemies and other objects, which is used to solve puzzles and progress in the game. After completing the main story mode, other post-game kingdoms are unlockable and an additional minigame, \"Luigi's Balloon World\", is playable. The game supports multiplayer and virtual reality via a Nintendo Labo kit.  The game was developed by Nintendo's Entertainment Planning & Development division, and began development soon after the release of Super Mario 3D World in 2013. Various ideas were suggested during development, and to incorporate them all, the team decided to employ a sandbox-style of gameplay. Unlike previous installments such as New Super Mario Bros. and Super Mario 3D World, which were aimed at a casual audience, the team designed Super Mario Odyssey to appeal to the series' core fans. The game also features a vocal theme song, \"Jump Up, Super Star!\", a first for the series. Odyssey was teased in 2016, announced in January 2017, and released in October of the same year.  Super Mario Odyssey received acclaim from critics who called it one of the best games in the series, with particular praise towards its inventiveness and originality. It also won numerous awards, including for game of the year. The game sold over 20 million copies by March 2021,[2] making it one of the best-selling Switch games and the fastest-selling Mario game. The game won numerous awards in various categories, and was also nominated multiple times over for Game of the Year.",
      "price": "60",
      "poster": "https://upload.wikimedia.org/wikipedia/en/8/8d/Super_Mario_Odyssey.jpg",
      "id": 7
    },
    {
      "title": "Need for Speed: Most Wanted",
      "publisher": "Electronic Arts",
      "developer": "EA Canada",
      "year": "2005",
      "genre": "Racing",
      "description": "Need for Speed: Most Wanted is a 2005 open world racing video game, and the ninth installment in the Need for Speed series. Developed by EA Canada and EA Black Box and published by Electronic Arts, it was released on November 11, 2005, for PlayStation 2, Xbox, GameCube, Nintendo DS, Microsoft Windows, Game Boy Advance and Xbox 360. An additional version, Need for Speed: Most Wanted 5-1-0, was released in the same year for PlayStation Portable. The game focuses on street racing-oriented game play involving a selection of events and racing circuits found within the fictional city of Rockport, with the game's main story involving players taking on the role of a street racer who must compete against 15 of the city's most elite street racers to become the most wanted racer of the group, in the process seeking revenge against one of the group who took their car and developing a feud with the city's police department.  Most Wanted brought in many notable improvements and additions over other entries in the series, its major highlight being more in-depth police pursuits. Certain editions of the game were also packaged with the ability for online multiplayer gaming. Upon its release, the game received positive reviews from critics and became a commercial success, selling 16 million copies worldwide, becoming one of the best entries in the series as a result. Its success later led to a collector's edition, Black Edition, which provided additional content for the game.  The game was later succeeded by Need for Speed: Carbon in 2006, which provided a sequel to Most Wanted's story, with a virtual edition being made available for PlayStation 3 via the PlayStation Store in May 2012, until it was discontinued the following year. A reboot of the game, developed by Criterion Games, was released in October 2012.",
      "price": "0",
      "poster": "https://upload.wikimedia.org/wikipedia/en/8/8e/Need_for_Speed_Most_Wanted_Box_Art.jpg",
      "id": 8
    }
  ],
  "users": [
    {}
  ]
}